[
    {
        "title": "How did Hanuman get his name?",
        "description": "This is a story about how Lord Hanuman got his name.",
        "story": "Lord Hanuman is an important God as far as Hinduism is concerned.He is one of the Chiranjeevis or the immortals.Apart from his most popular name Hanuman, he is also known as Anjaneya (Son of Anjana), Maruti (Son of Marut, the Wind God),Bajrang Bali (the strong one who has limbs as hard as the Vajra) etc.We may wonder why he was named as Hanuman. There are many stories regarding this. One of them is shown below :-When Hanuman was a child, he mistook the Sun as a fruit and flew towards it to devour it. When he devoured the Sun, darkness prevailed everywhere and all were worried. Seeing this, Lord Indra came to the rescue of the Sun and hit Hanuman with his weapon Vajra.Hanuman was hit by Vajra on his jaw (Hanu or हनु in Sanskrit). As a result, his jaw got disfigured or inflamed. That is how he got the name “Hanuman” that means one with a prominent or disfigured ",
        "moral": "Moral"
    },
    {
        "title": "Vishnu's Mydrid Kurma Avatar",
        "description": "The churning of the milk ocean, called samudra manthanam, is an important Hindu myth that has many eternal social and spiritual lessons.",
        "story": "This event occurs in the context of Lord Vishnu’s kUrmAvatAra (the descent in the form of a giant turtle).  In the old golden mythical age of kRta yuga when the devas (the “good guys”) and the asuras (the “bad guys”) were young and always fighting for supremacy over the administration of the universe, they both found out that they were equally matched in strength and talent. So for a long time, no party was permanently victorious. So after one of these battles, the devas were ousted from their capital city in heaven amaravatI and it was occupied by the asuras.So, the devas went to Lord Brahma for advice. Brahma (despite being the creator of the entire universe) advised them to go visit Lord Vishnu, so they all went to visit Lord Vishnu at his residence on the milk ocean (ksheer sagar). Vishnu comes up with the idea that the milk ocean should be churned, which would then yield the nectar of immortality (amRtam) which would make the devas invincible. Then they would be able to definitively defeat the asuras.The devas were excited to hear about this idea. However, Vishnu said there was a caveat — they couldn’t churn the ocean by themselves. They had to work out a truce with the asuras to collaborate on this massive undertaking. So Indra sent a messenger to Virocana, the leader of the asuras detailing the plan and asking for collaboration. Some of the senior asura leaders were completely opposed to the plan as they could smell something fishy in this sudden proposal for peace. However, the majority of them thought this might be a good idea, as they might be able to negotiate some deal for their contribution. So it was all set. The devas and asuras would churn the milk ocean as a team. However, they needed a “churning rod” and a rope to churn with.Vishnu again came up with the idea to use mandara mountain as the churning rod, and the serpent king vAsuki as the rope. So they uprooted the mountain and set it in the ocean. But it took a lot more to convince the serpent to participate. He was rightly concerned that this task would kill him because of the rubbing against the mountain. Vishnu reassured him that his body would not be harmed and he would also get a portion of the nectar for his effort. With vAsuki also committed to the task, everything was set in motion.Vishnu, thinking ahead, also managed to get the devas positioned on the tail end of the serpent so that they would be spared the venom spewing from the mouths of the serpent.Soon after they started churning they found out that the weight of the mountain was causing it to sink into the ocean bed! This is when Vishnu creates a form of a giant turtle out of himself and positions himself under the mountain to support it.Now, the teams were really set to churn the ocean in all seriousness. As it happens with any new endeavor, problems and obstacles come first. So the first product of the churning was the toxic mixture halAhala.It spread in the ocean and its fumes filled the air, choking and blinding the teams, and killing thousands of creatures. Lord Shiva stepped in and rescued everyone by drinking up the poison. This is when he got his name viShakaNTha, nIlakaNTha, shithikaNTha, etc.With the poison cleared, the teams of devas and asuras continued to churn for a long time. Finally, good things started to come out of the ocean.Celestial weapons, divine animals, goddess of liquor (whom the asuras asked to be with), divine trees, divine flower, gems, goddess Lakshmi (who chose to be with Vishnu).At the end, the divine doctor dhanvantari came out holding the golden pot filled with the nectar.As soon as the asuras saw dhanvantari, they forgot everything about their pact with the devas and snatched the pot from him.As the devas looked to Vishnu for what to do next, Vishnu gave them a reassuring nod and gestured to them to remain calm.Next, Vishnu creates another form, that of the bewitchingly beautiful woman mohini. She begins to dance in a most sensuous manner, and as the asuras hear and see her, they fall into a mesmerizing trance, and hand over the pot of nectar to her. She tells them that she will distribute the nectar to everyone, and asks the devas and asuras to sit in two rows.As was planned, she starts pouring out the nectar to the devas, and the asuras are waiting patiently. She is trying to make sure that the pot becomes empty by the end of the row of devas, so that the asuras don’t get any nectar. Only the asura rAhu suspects this and quietly slips away from the asura line and hides behind the devas. As mohini continues to pass by each deva, rahu also receives some nectar into his bowl.However, as he is drinking it, sUrya (sun) and candra (moon) discover him and point him out to mohini.Quick as lightning, she releases the sudarshana cakra to cut off his head before the nectar can go down his throat. But he is still able to retain the nectar that he drank in his head and this is how rAhu’s head became immortal. From then on, rAhu swore eternal vengeance on sUrya and candra, and even to this day we see him swallow up the sun and the moon during their eclipses. In the end, all the devas drink up the nectar, leaving nothing for the asuras. With their new strength, they defeat the asuras and regain their heavenly kingdom.",
        "moral": "Moral"
    },
    {
        "title": "Title",
        "description": "Description",
        "story": "Story",
        "moral": "Moral"
    },
    {
        "title": "Title",
        "description": "Description",
        "story": "Story",
        "moral": "Moral"
    }
]